src/cf/InformationRegisters/НеудаленныеОбъекты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>НеудаленныеОбъекты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоПопыток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяПоследнейПопытки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
						<v8:TypeSet>cfg:BusinessProcessRef</v8:TypeSet>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCalculationTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:TaskRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/НеудаленныеОбъекты/Ext/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2023, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Формирует таблицу с количеством попыток для указанных объектов.
// Если объект ранее не удалялся, то запись о количестве попыток будет отсутствовать.
// 
// Параметры:
//   Объекты - Массив из ЛюбаяСсылка
// Возвращаемое значение:
//   ТаблицаЗначений:
//   * УдаляемыйСсылка - ЛюбаяСсылка
//   * КоличествоПопыток - Число
//
Функция КоличествоПопытокОбъектов(Объекты) Экспорт
	Запрос = Новый Запрос;
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	НеудаленныеОбъекты.Объект КАК УдаляемыйСсылка,
		|	НеудаленныеОбъекты.КоличествоПопыток КАК КоличествоПопыток
		|ИЗ
		|	РегистрСведений.НеудаленныеОбъекты КАК НеудаленныеОбъекты
		|ГДЕ
		|	НеудаленныеОбъекты.Объект В (&СписокОбъектов)
		|	И НеудаленныеОбъекты.КоличествоПопыток > 0";
	
	Запрос.УстановитьПараметр("СписокОбъектов", Объекты);
	
	РезультатЗапроса = Запрос.Выполнить();
	КоличествоПопытокОбъектов = РезультатЗапроса.Выгрузить();
	КоличествоПопытокОбъектов.Индексы.Добавить("УдаляемыйСсылка");
	
	Возврат КоличествоПопытокОбъектов;
КонецФункции

// Добавляет запись в регистр.
// 
// Параметры:
//   НеудаленнаяСсылка - ЛюбаяСсылка
//
Процедура Добавить(НеудаленнаяСсылка) Экспорт
	Запись = РегистрыСведений.НеудаленныеОбъекты.СоздатьМенеджерЗаписи();
	Запись.Объект = НеудаленнаяСсылка;
	Если ЗначениеЗаполнено(Запись.Объект) Тогда
		Запись.Записать();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#КонецЕсли
